[{"data":1,"prerenderedAt":72},["Reactive",2],{"tools-tool-cairis":3,"criteria-tool":17},{"slug":4,"name":5,"description":6,"pros_cons":7,"rating":10},"cairis","Cairis","\u003Ch2>Kurzbeschreibung\u003C/h2>\n\n\u003Cp>Cairis steht für &ldquo;Computer Aided Integration of Requirements and Information Security&rdquo; und bietet eine Plattform für die Erarbeitung, Spezifikation und Validierung sicherer und benutzbarer Systeme.\u003C/p>\n\n\u003Ch2>Workflow und Usability\u003C/h2>\n\n\u003Cp>Cairis ist ein webbasiertes Programm, welches sich durch eine einfache und intuitive Oberflächengestaltung aus- zeichnet. Cairis hebt sich von anderen Threat Modeling Tools durch die Einführung von &ldquo;Environments&rdquo; (Umge- bungen) ab. Eine Umgebung kann ein System darstellen, das zu einer bestimmten Tageszeit oder an einem bestimm- ten physischen Ort arbeitet. Umgebungen umfassen sowohl sichtbare Phänomene wie Assets, Aufgaben, Personas und Angreifer als auch unsichtbare Phänomene wie Ziele, Schwachstellen und Bedrohungen.\u003C/p>\n\n\u003Cp>Workflow und Usability sind sehr intuitiv. Wie bei den meisten Tools erstellt man eine Liste von Assets, Require- ments, Personas und weiteren, um so die Projektarchitektur zu umrei&szlig;en. Mit ein paar Klicks kann man verschiedene Modeltypen auswählen und bekommt entsprechende Diagramme direkt in der Anwendung. Jederzeit ist man auch in der Lage einen Bericht zu generieren.\u003C/p>\n\n\u003Ch2>Integration in den Softwareentwicklungsprozess\u003C/h2>\n\n\u003Cp>Durch einfache und intuitive Bedienung sowie eine ausführliche Dokumentation ist Cairis eine gute und beliebte Wahl als Threat Modeling Tool. Cairis wurde und wird kommerziell genutzt. Cairis ist darauf ausgelegt von Gruppen bzw. Teams genutzt zu werden.\u003C/p>\n\n\u003Cp>Cairis behauptet von sich selbst nicht &ldquo;the one tool to rule them all&rdquo; zu sein. Vielmehr sollte Cairis in Kombination mit anderen Tools genutzt werden. Daher sollte dieses Tool vor allem als Ergänzung gesehen werden. Ebenfalls wird eine API angeboten, welche es ermöglicht, Applikationen zu erstellen, die mit Daten von Cairis arbeiten.\u003C/p>\n\n\u003Ch2>Fazit\u003C/h2>\n\n\u003Cp>Cairis ist ein einfach zu lernendes und trotzdem sehr umfangreiches Threat Modeling Tool welches als Ergänzung zu anderen Tools und Vorgehensweisen gesehen werden kann. Cairis ist quelloffen und schon seit über 10 Jahren in Benutzung.\u003C/p>\n\n\u003Cp>Webseite: \u003Ca href=\"https://cairis.org/\">https://cairis.org/\u003C/a>\u003Cbr />\nGitHub: \u003Ca href=\"https://github.com/cairis-platform/cairis\">https://github.com/cairis-platform/cairis\u003C/a>\u003C/p>\n",{"advantages":8,"disadvantages":9},[],[],{"agile-methoden":11,"tool-integration":11,"arbeitsteiligkeit":12,"datenhaltung":12,"kosten":11,"konfigurierbar":12,"einstiegshürde":11,"multi-plattform":13,"templates":16},1,-1,[11,14,15],2,3,[],[18,22,26,30,34,38,42,46,58],{"slug":19,"short":20,"name":21},"agile-methoden","Abbildung agiler Arbeitsmethoden möglich (User Stories, Sprints etc.)","Das Tool unterstützt die Abbildung agiler Arbeitsmethoden, wie bspw. User Stories, Sprints etc.",{"slug":23,"short":24,"name":25},"tool-integration","Toolchain-Integration","Eine Integration in andere Tools für iterative Softwareentwicklung (z.B. CI/CD-Tools) ist ohne besonderen Aufwand möglich. ",{"slug":27,"short":28,"name":29},"arbeitsteiligkeit","Unterstützung von Arbeitsteiligkeit auf Personen-/Teamebene","Mehrere Personen oder alle Teammitglieder sollen während des Softwareentwicklungsprozesses parallel oder iterativ mit dem Tool arbeiten.",{"slug":31,"short":32,"name":33},"datenhaltung","Nicht-proprietäre interoperable Datenhaltung (z. B. Text-Formate)","Vom Tool verarbeitete sowie erzeugte Dateien (z.B. Berichte) sollen in nicht-proprietären Formaten vorliegen (z.B. txt, yaml), um bspw. eine flexible Weiterverarbeitung zu ermöglichen.",{"slug":35,"short":36,"name":37},"kosten","Kostengünstig/ kostenlos erhältlich","Das Tool ist kostenlos nutzbar.",{"slug":39,"short":40,"name":41},"konfigurierbar","Konfigurierbarkeit","Das Tool kann konfiguriert werden und somit an die eigene Arbeitsweise bzw. das zu bearbeitende Softwareprojekt angepasst werden.",{"slug":43,"short":44,"name":45},"einstiegshürde","Geringe Einstiegshürde","Die Nutzung des Tools ist intuitiv oder leicht erlernbar.",{"slug":47,"short":48,"name":49,"type":50,"options":51},"multi-plattform","Mögliche Betriebssysteme","Welches Betriebssystem soll verwendet werden? (Antwort optional)","option",[52,54,56],{"key":11,"name":53},"Linux",{"key":14,"name":55},"MacOS",{"key":15,"name":57},"Windows",{"slug":59,"short":60,"name":61,"type":50,"options":62},"templates","Bereitstellung von Templates für Threat-Modeling-Methoden","Das Tool stellt Templates für folgende Threat-Modeling-Methoden bereit. (Antwort optional)",[63,65,67,69],{"key":11,"name":64},"STRIDE",{"key":14,"name":66},"PASTA",{"key":15,"name":68},"LINDDUN",{"key":70,"name":71},4,"CIA",1688923961267]