[{"data":1,"prerenderedAt":82},["Reactive",2],{"criteria-tool":3,"tools-tool-owasp-thread-dragon":61},[4,8,12,16,20,24,28,32,47],{"slug":5,"short":6,"name":7},"agile-methoden","Abbildung agiler Arbeitsmethoden möglich (User Stories, Sprints etc.)","Das Tool unterstützt die Abbildung agiler Arbeitsmethoden, wie bspw. User Stories, Sprints etc.",{"slug":9,"short":10,"name":11},"tool-integration","Toolchain-Integration","Eine Integration in andere Tools für iterative Softwareentwicklung (z.B. CI/CD-Tools) ist ohne besonderen Aufwand möglich. ",{"slug":13,"short":14,"name":15},"arbeitsteiligkeit","Unterstützung von Arbeitsteiligkeit auf Personen-/Teamebene","Mehrere Personen oder alle Teammitglieder sollen während des Softwareentwicklungsprozesses parallel oder iterativ mit dem Tool arbeiten.",{"slug":17,"short":18,"name":19},"datenhaltung","Nicht-proprietäre interoperable Datenhaltung (z. B. Text-Formate)","Vom Tool verarbeitete sowie erzeugte Dateien (z.B. Berichte) sollen in nicht-proprietären Formaten vorliegen (z.B. txt, yaml), um bspw. eine flexible Weiterverarbeitung zu ermöglichen.",{"slug":21,"short":22,"name":23},"kosten","Kostengünstig/ kostenlos erhältlich","Das Tool ist kostenlos nutzbar.",{"slug":25,"short":26,"name":27},"konfigurierbar","Konfigurierbarkeit","Das Tool kann konfiguriert werden und somit an die eigene Arbeitsweise bzw. das zu bearbeitende Softwareprojekt angepasst werden.",{"slug":29,"short":30,"name":31},"einstiegshürde","Geringe Einstiegshürde","Die Nutzung des Tools ist intuitiv oder leicht erlernbar.",{"slug":33,"short":34,"name":35,"type":36,"options":37},"multi-plattform","Mögliche Betriebssysteme","Welches Betriebssystem soll verwendet werden? (Antwort optional)","option",[38,41,44],{"key":39,"name":40},1,"Linux",{"key":42,"name":43},2,"MacOS",{"key":45,"name":46},3,"Windows",{"slug":48,"short":49,"name":50,"type":36,"options":51},"templates","Bereitstellung von Templates für Threat-Modeling-Methoden","Das Tool stellt Templates für folgende Threat-Modeling-Methoden bereit. (Antwort optional)",[52,54,56,58],{"key":39,"name":53},"STRIDE",{"key":42,"name":55},"PASTA",{"key":45,"name":57},"LINDDUN",{"key":59,"name":60},4,"CIA",{"slug":62,"name":63,"description":64,"pros_cons":65,"rating":78},"owasp-thread-dragon","OWASP Threat Dragon","\u003Ch2>Kurzbeschreibung\u003C/h2>\n\n\u003Cp>OWASP Threat Dragon ist ein grafisches und quelloffenens Threat-Modeling-Tool, das es erlaubt die drei verschiedenen Methodiken STRIDE, LIDDUN und CIA in Software-Entwicklungsprozessen zu nutzen.\u003C/p>\n\n\u003Cp>Workflow und Usability\u003C/p>\n\n\u003Cp>Das Projekt zielt auf eine leichte Erlernbarkeit und breite Verwendbarkeit. Dementsprechend ist schon die Bedienoberfläche minimal gehalten. Der Workflow ist linear und gliedert sich in die folgenden immer gleichen Schritte:\u003C/p>\n\n\u003Cul>\n\t\u003Cli>Auswahl eines Threat-Model-Typs (STRIDE, LIDDUN, CIA und Generic)\u003C/li>\n\t\u003Cli>Grafische Modellierung von Systemkomponenten, deren Datenflüssen und Trust Boundaries\u003C/li>\n\t\u003Cli>Modelltyp-bezogenes Definierungen von Threats und Mitigations\u003C/li>\n\t\u003Cli>Abrufen des Reports\u003C/li>\n\u003C/ul>\n\n\u003Cp>Abgesehen vom grafischen Diagramm-Editor beschränkt sich die Programmlogik von Threat Dragon auf die Grundelemente des Threat Modelings. Unterstützt wird insbesondere die Verwaltung und das Reporting der verschiedenen Threat-Typen, die die zur Auswahl stehenden Modellierungsmethoden den hinzugefügten Systemkomponenten zuordnen. Threat Dragon stellt also sicher, dass pro hinzugefügter Systemkomponente alle vorgesehen Threat-Typen abgefragt werden, noch nicht mit einer Ma&szlig;nahme verknüpfte (Control, Prevention, Mitigation) Threats in einer Warnfarbe angezeigt werden und dass vollständige Reports generiert werden.\u003C/p>\n\n\u003Ch2>Integration in den Softwareentwicklungsprozess\u003C/h2>\n\n\u003Cp>Die Philosophie der leichten Erlernbarkeit und breiten Verwendbarkeit zieht sich auch durch das grundsätzliche Programm-Design. Die Schnittstelle von Threat Dragon zu verschiedenen agilen oder nicht-agilen Vorgehensmodellen, organisatorischen Rahmenbedingungen wie Compliance-Verpflichtungen, gro&szlig;en oder kleinen Teams oder weiteren Tools, die im Softwareentwicklungsprozess angewandt werden, ist stets die bedienende Person. Der individuellen Flexibilität steht daher ein geringer Unterstützungsgrad in den folgenden Feldern gegenüber:\u003C/p>\n\n\u003Cul>\n\t\u003Cli>\n\t\u003Cp>Keine Integration mit agilen Vorgehensmodellen, deren Kommunikationsformen und Artefakttypen (z. B. keine Verwaltung von Meetings, Sprints, User Storys)\u003C/p>\n\t\u003C/li>\n\t\u003Cli>\n\t\u003Cp>Keine Verwaltung von Rollen und Arbeitsteiligkeit auf Organisationsebene, keine Integration mit agilen Skalierungs-Frameworks\u003C/p>\n\t\u003C/li>\n\t\u003Cli>\n\t\u003Cp>Keine Integration mit Tools und Prozessen auf Ebene von Compliance-Verpflichtungen (ISMS, Normen etc.)\u003C/p>\n\t\u003C/li>\n\t\u003Cli>\n\t\u003Cp>Keine Integration mit Architektur- und Modellierungstools oder sonstigen Tools zur Komponentenverwaltung im Entwicklungsprozess (z. B. kein Import von Asset-Listen aus Dependency- Management-Tools)\u003C/p>\n\t\u003C/li>\n\t\u003Cli>\n\t\u003Cp>Ausbaufähige Integration mit CI/CD-Tools (nur Datenhaltung in github, bisher wenig konfigurierbar)\u003C/p>\n\t\u003C/li>\n\u003C/ul>\n\n\u003Ch2>Fazit\u003C/h2>\n\n\u003Cp>OWASP Threat Dragon zielt auf eine geringe Einsatzschwelle durch leichte Erlernbarkeit. Erreicht werden soll dies durch den Fokus auf Usability und einen minimalistischen Funktionsumfang, die Beschränkung auf die Kernprozesse von Threat-Modeling sowie die geringe Integration in umgebende Prozesse und Systeme.\u003C/p>\n\n\u003Cp>Dieser Ansatz wird in kleineren Organisationen und Teams, die ihre Tools und Prozesse frei wählen können, oft zum Erfolg führen. Die nur minimale Führung beim Hinzufügen von Komponenten und der Auswahl von Threats und Gegenma&szlig;nahmen erfordert allerdings auch hier die individuelle Methodensicherheit beim Threat-Modelling und einen guten Projekt-Überblick, was in einem gewissen Widerspruch zum recht rigiden Workflow steht.\u003C/p>\n\n\u003Cp>In gro&szlig;en Organisationen mit stärker festgelegten und strukturierten Entwicklungsprojekten mit hoher Arbeitsteiligkeit wird sich die bewusst geringe Integration mit den umgebenden Prozessen und der dementsprechend geringe Unterstützungsgrad auf Ebene der o.g. Herausforderungen vermutlich öfter nachteilig auswirken.\u003C/p>\n",{"advantages":66,"disadvantages":72},[67,68,69,70,71],"kostenlos, permissives Lizenzmodell","leichte Erlernbarkeit","Cross-Plattform-Verfügbarkeit","hohe Flexibilität bzgl. der organisatorischen und methodischen Integration (Unterstützung verschiedener Threat Modeling Methoden, kollaborative Nutzung möglich)","hohe Flexibilität bei der Toolchain- und Workflow-Integration",[73,74,75,76,77],"stark vorgegebner Workflow","wenig Konfigurationsmöglichkeiten","wenig Hilfestellung beim Modellierungsprozess","geringe Unterstützung bei arbeitsorganisatorischen Aspekten (keine Abbildung von Prozessen auf der Ebene von Vorgehensmodellen, Teamorganisation, Compliance, etc.)","geringe technische Automatisierungs- und Integrationsfähigkeit innerhalb der Entwicklung-Toolchain",{"agile-methoden":79,"tool-integration":79,"arbeitsteiligkeit":79,"datenhaltung":79,"kosten":79,"konfigurierbar":79,"einstiegshürde":39,"multi-plattform":80,"templates":81},-1,[39,42,45],[39,42,45,59],1688923961305]